namespace backend.Models
{
    public class RankProvider
    {
        private static readonly List<(int MinSize, string Animal, string Message)> Ranks = new()
        {
            (1500, "Ктулху", "Твій пеніс як Ктулху, що спить на дні океану"),
            (1000, "Ґодзілла", "Твій пеніс як в Ґодзілли"),
            (600, "Левіафан", "Твій пеніс як в левіафана"),
            (400, "Кракен", "Твій пеніс як в глибоководного кракена"),
            (300, "Дракон", "Твій пеніс як в дракона"),
            (290, "Синій кит-полосатик", "Найбільший член як у кита-полосатика!"),
            (180, "Викопний гігантський морж", "Твій пеніс як в викопного гігантського моржа"),
            (161, "Більше за всіх ссавців", "Твій пеніс майже найбільший ніж у всіх тварин!"),
            (151, "Гринда", "Твій пеніс як в гринди"),
            (141, "Кашалот", "Твій пеніс як в кашалота"),
            (131, "Сейвал", "Твій пеніс як в сейвала"),
            (121, "Сірий кит", "Твій пеніс як в сірого кита"),
            (111, "Слон", "Твій пеніс як в слона"),
            (101, "Косатка", "Твій пеніс як в косатки"),
            (96, "Жираф", "Твій пеніс як в жирафа"),
            (91, "Нарвал", "Твій пеніс як в нарвала"),
            (90, "Бик", "Твій пеніс як в бика"),
            (85, "Малий смугастик", "Твій пеніс як в малого смугастика"),
            (80, "Білуха", "Твій пеніс як в білухи"),
            (75, "Американський бізон", "Твій пеніс як в американського бізона"),
            (70, "Носоріг", "Твій пеніс як в носорога"),
            (65, "Дюгон", "Твій пеніс як в дюгона"),
            (63, "Морж", "Твій пеніс як в моржа"),
            (60, "Кінь", "Твій пеніс як в коня"),
            (56, "Верблюд", "Твій пеніс як в верблюда"),
            (53, "Як", "Твій пеніс як в яка"),
            (51, "Віслюк", "Твій пеніс як в віслюка"),
            (50, "Аргентинська качка", "Твій пеніс як в аргентинської качки"),
            (49, "Вапіті", "Твій пеніс як в вапіті"),
            (48, "Тапір", "Твій пеніс як в тапіра"),
            (47, "Лось", "Твій пеніс як в лося"),
            (46, "Зебра", "Твій пеніс як в зебри"),
            (45, "Свиня", "Твій пеніс як в свині"),
            (44, "Зебу", "Твій пеніс як в зебу"),
            (43, "Африканський буйвол", "Твій пеніс як в африканського буйвола"),
            (42, "Дикий кабан", "Твій пеніс як в дикого кабана"),
            (41, "Буйвол", "Твій пеніс як в буйвола"),
            (40, "Морський слон", "Твій пеніс як в морського слона"),
            (39, "Топі", "Твій пеніс як в топі"),
            (38, "Альпака", "Твій пеніс як в альпаки"),
            (37, "Водяний олень", "Твій пеніс як в водяного оленя"),
            (36, "Орікс", "Твій пеніс як в орікса"),
            (35, "Ламантин", "Твій пеніс як в ламантина"),
            (34, "Великий куду", "Твій пеніс як в великого куду"),
            (33, "Імпала", "Твій пеніс як в імпали"),
            (32, "Лама", "Твій пеніс як в лами"),
            (31, "Гну", "Твій пеніс як в гну"),
            (30, "Дельфін", "Твій пеніс як в дельфіна"),
            (29, "Гуанако", "Твій пеніс як в гуанако"),
            (28, "Гігантський мурахоїд", "Твій пеніс як в гігантського мурахоїда"),
            (27, "Благородний олень", "Твій пеніс як в благородного оленя"),
            (26, "Бобер", "Твій пеніс як в бобра"),
            (25, "Гігантська черепаха", "Твій пеніс як в гігантської черепахи"),
            (23, "Білий ведмідь", "Твій пеніс як в білого ведмедя"),
            (22, "Бурий ведмідь", "Твій пеніс як в бурого ведмедя"),
            (21, "Леопард", "Твій пеніс як в леопарда"),
            (20, "Гусак", "Твій пеніс як в гусака"),
            (19, "Койот", "Твій пеніс як в койота"),
            (18, "Вовк", "Твій пеніс як в вовка"),
            (17, "Баран", "Твій пеніс як в барана"),
            (16, "Гієна", "Твій пеніс як в гієни"),
            (15, "Собака", "Твій пеніс як в собаки"),
            (14, "Ягуар", "Твій пеніс як в ягуара"),
            (13, "Гепард", "Твій пеніс як в гепарда"),
            (12, "Крокодил", "Твій пеніс як в крокодила"),
            (11, "Пума", "Твій пеніс як в пуми"),
            (10, "Тюлень", "Твій пеніс як в тюленя"),
            (9, "Лисиця", "Твій пеніс як в лисиці"),
            (8, "Шимпанзе", "Твій пеніс як в шимпанзе"),
            (7, "Мандрил", "Твій пеніс як в мандрила"),
            (6, "Єнот", "Твій пеніс як в єнота"),
            (5, "Змія", "Твій пеніс як в змії"),
            (4, "Панда", "Твій пеніс як в панди"),
            (3, "Горила", "Твій пеніс як в горили"),
            (2, "Кіт", "Твій пеніс як в кота"),
            (1, "Індик", "Твій пеніс як в індика"),
            (0, "Землерийка", "Твій пеніс як в землерийки")
        };

        public static string GetRank(int size)
        {
            return Ranks.FirstOrDefault(r => size >= r.MinSize).Animal ?? "Землерийка";
        }
        public static string GetRankMessage(int size)
        {
            return Ranks.FirstOrDefault(r => size >= r.MinSize).Message ?? string.Empty;
        }
    }
}
